#language: ru
Функционал: Вклад

  Сценарий: Калькулятор вклада

    Когда выбор пункт в разделе вклады: "Калькулятор"
    Тогда присутсвует заголовок "Рассчитайте доходность по вкладу"

    Когда выбрана валюта "Доллары США"
    Когда сумма вклада "50000"
    Когда срок вклада "9"
    Когда ежемесячное пополнение "1000"
    Когда отмечен пункт "Ежемесячная капитализация"

    Тогда ставка соответствует "0.75%"
    Тогда начислено "301,42"
    Тогда к пополнению "8 000"
    Тогда итого "58 301,42"


  Сценарий: Калькулятор вклада рубли

    Когда выбор пункт в разделе вклады: "Калькулятор"
    Тогда присутсвует заголовок "Рассчитайте доходность по вкладу"

    Когда выбрана валюта "Рубли"
    Когда сумма вклада "2000000"
    Когда срок вклада "6"
    Когда ежемесячное пополнение "30000"
    Когда отмечен пункт "Ежемесячная капитализация"
    Когда отмечен пункт "Частичное снятие"

    Тогда ставка соответствует "6.25%"
    Тогда начислено "65 132,87"
    Тогда к пополнению "150 000"
    Тогда итого "2 215 132,87"



